var stations = [
    {
        "code": "0000",
        "name": "居組"
    },
    {
        "code": "0001",
        "name": "東浜"
    },
    {
        "code": "0002",
        "name": "岩美"
    },
    {
        "code": "0003",
        "name": "大岩"
    },
    {
        "code": "0004",
        "name": "福部"
    },
    {
        "code": "0006",
        "name": "鳥取"
    },
    {
        "code": "0007",
        "name": "湖山"
    },
    {
        "code": "0008",
        "name": "鳥取大学前"
    },
    {
        "code": "0009",
        "name": "末恒"
    },
    {
        "code": "0010",
        "name": "宝木"
    },
    {
        "code": "0011",
        "name": "浜村"
    },
    {
        "code": "0012",
        "name": "青谷"
    },
    {
        "code": "0013",
        "name": "泊"
    },
    {
        "code": "0014",
        "name": "松崎"
    },
    {
        "code": "0015",
        "name": "倉吉"
    },
    {
        "code": "0016",
        "name": "下北条"
    },
    {
        "code": "0017",
        "name": "由良"
    },
    {
        "code": "0018",
        "name": "浦安"
    },
    {
        "code": "0019",
        "name": "八橋"
    },
    {
        "code": "0020",
        "name": "赤碕"
    },
    {
        "code": "0021",
        "name": "中山口"
    },
    {
        "code": "0022",
        "name": "下市"
    },
    {
        "code": "0023",
        "name": "御来屋"
    },
    {
        "code": "0024",
        "name": "名和"
    },
    {
        "code": "0025",
        "name": "大山口"
    },
    {
        "code": "0026",
        "name": "淀江"
    },
    {
        "code": "0027",
        "name": "伯耆大山"
    },
    {
        "code": "0028",
        "name": "東山公園"
    },
    {
        "code": "0029",
        "name": "米子"
    },
    {
        "code": "0031",
        "name": "安来"
    },
    {
        "code": "0032",
        "name": "荒島"
    },
    {
        "code": "0033",
        "name": "揖屋"
    },
    {
        "code": "0034",
        "name": "東松江"
    },
    {
        "code": "0035",
        "name": "松江"
    },
    {
        "code": "0036",
        "name": "乃木"
    },
    {
        "code": "0037",
        "name": "玉造温泉"
    },
    {
        "code": "0038",
        "name": "来待"
    },
    {
        "code": "0039",
        "name": "宍道"
    },
    {
        "code": "0040",
        "name": "荘原"
    },
    {
        "code": "0041",
        "name": "直江"
    },
    {
        "code": "0042",
        "name": "出雲市"
    },
    {
        "code": "0043",
        "name": "西出雲"
    },
    {
        "code": "0044",
        "name": "出雲神西"
    },
    {
        "code": "0045",
        "name": "江南"
    },
    {
        "code": "0046",
        "name": "小田"
    },
    {
        "code": "0047",
        "name": "田儀"
    },
    {
        "code": "0048",
        "name": "波根"
    },
    {
        "code": "0049",
        "name": "久手"
    },
    {
        "code": "0050",
        "name": "大田市"
    },
    {
        "code": "0051",
        "name": "静間"
    },
    {
        "code": "0052",
        "name": "五十猛"
    },
    {
        "code": "0053",
        "name": "仁万"
    },
    {
        "code": "0054",
        "name": "馬路"
    },
    {
        "code": "0055",
        "name": "湯里"
    },
    {
        "code": "0056",
        "name": "温泉津"
    },
    {
        "code": "0057",
        "name": "石見福光"
    },
    {
        "code": "0058",
        "name": "黒松"
    },
    {
        "code": "0059",
        "name": "浅利"
    },
    {
        "code": "0060",
        "name": "江津"
    },
    {
        "code": "0061",
        "name": "都野津"
    },
    {
        "code": "0062",
        "name": "敬川"
    },
    {
        "code": "0063",
        "name": "波子"
    },
    {
        "code": "0064",
        "name": "久代"
    },
    {
        "code": "0065",
        "name": "下府"
    },
    {
        "code": "0066",
        "name": "浜田"
    },
    {
        "code": "0067",
        "name": "西浜田"
    },
    {
        "code": "0068",
        "name": "周布"
    },
    {
        "code": "0069",
        "name": "折居"
    },
    {
        "code": "0070",
        "name": "三保三隅"
    },
    {
        "code": "0071",
        "name": "岡見"
    },
    {
        "code": "0072",
        "name": "鎌手"
    },
    {
        "code": "0073",
        "name": "石見津田"
    },
    {
        "code": "0074",
        "name": "益田"
    },
    {
        "code": "0075",
        "name": "倉敷"
    },
    {
        "code": "0075",
        "name": "倉敷"
    },
    {
        "code": "0076",
        "name": "清音"
    },
    {
        "code": "0077",
        "name": "総社"
    },
    {
        "code": "0078",
        "name": "豪渓"
    },
    {
        "code": "0079",
        "name": "日羽"
    },
    {
        "code": "0080",
        "name": "美袋"
    },
    {
        "code": "0081",
        "name": "備中広瀬"
    },
    {
        "code": "0082",
        "name": "備中高梁"
    },
    {
        "code": "0083",
        "name": "木野山"
    },
    {
        "code": "0084",
        "name": "備中川面"
    },
    {
        "code": "0085",
        "name": "方谷"
    },
    {
        "code": "0087",
        "name": "井倉"
    },
    {
        "code": "0088",
        "name": "石蟹"
    },
    {
        "code": "0089",
        "name": "新見"
    },
    {
        "code": "0090",
        "name": "布原"
    },
    {
        "code": "0091",
        "name": "備中神代"
    },
    {
        "code": "0092",
        "name": "足立"
    },
    {
        "code": "0093",
        "name": "新郷"
    },
    {
        "code": "0093",
        "name": "新郷"
    },
    {
        "code": "0094",
        "name": "上石見"
    },
    {
        "code": "0096",
        "name": "生山"
    },
    {
        "code": "0097",
        "name": "上菅"
    },
    {
        "code": "0098",
        "name": "黒坂"
    },
    {
        "code": "0099",
        "name": "根雨"
    },
    {
        "code": "0100",
        "name": "武庫"
    },
    {
        "code": "0101",
        "name": "江尾"
    },
    {
        "code": "0103",
        "name": "伯耆溝口"
    },
    {
        "code": "0104",
        "name": "岸本"
    },
    {
        "code": "0106",
        "name": "糸崎"
    },
    {
        "code": "0106",
        "name": "糸崎"
    },
    {
        "code": "0107",
        "name": "三原"
    },
    {
        "code": "0107",
        "name": "三原"
    },
    {
        "code": "0107",
        "name": "三原"
    },
    {
        "code": "0108",
        "name": "本郷"
    },
    {
        "code": "0109",
        "name": "河内"
    },
    {
        "code": "0110",
        "name": "入野"
    },
    {
        "code": "0111",
        "name": "白市"
    },
    {
        "code": "0112",
        "name": "西高屋"
    },
    {
        "code": "0113",
        "name": "西条"
    },
    {
        "code": "0114",
        "name": "八本松"
    },
    {
        "code": "0115",
        "name": "瀬野"
    },
    {
        "code": "0116",
        "name": "中野東"
    },
    {
        "code": "0117",
        "name": "安芸中野"
    },
    {
        "code": "0118",
        "name": "海田市"
    },
    {
        "code": "0119",
        "name": "向洋"
    },
    {
        "code": "0120",
        "name": "天神川"
    },
    {
        "code": "0122",
        "name": "広島"
    },
    {
        "code": "0123",
        "name": "新白島"
    },
    {
        "code": "0124",
        "name": "横川"
    },
    {
        "code": "0125",
        "name": "西広島"
    },
    {
        "code": "0126",
        "name": "新井口"
    },
    {
        "code": "0127",
        "name": "五日市"
    },
    {
        "code": "0128",
        "name": "廿日市"
    },
    {
        "code": "0129",
        "name": "宮内串戸"
    },
    {
        "code": "0130",
        "name": "阿品"
    },
    {
        "code": "0131",
        "name": "宮島口"
    },
    {
        "code": "0132",
        "name": "前空"
    },
    {
        "code": "0133",
        "name": "大野浦"
    },
    {
        "code": "0134",
        "name": "玖波"
    },
    {
        "code": "0135",
        "name": "大竹"
    },
    {
        "code": "0136",
        "name": "和木"
    },
    {
        "code": "0137",
        "name": "岩国"
    },
    {
        "code": "0138",
        "name": "南岩国"
    },
    {
        "code": "0139",
        "name": "藤生"
    },
    {
        "code": "0140",
        "name": "通津"
    },
    {
        "code": "0141",
        "name": "由宇"
    },
    {
        "code": "0142",
        "name": "神代"
    },
    {
        "code": "0143",
        "name": "大畠"
    },
    {
        "code": "0144",
        "name": "柳井港"
    },
    {
        "code": "0145",
        "name": "柳井"
    },
    {
        "code": "0146",
        "name": "田布施"
    },
    {
        "code": "0147",
        "name": "岩田"
    },
    {
        "code": "0148",
        "name": "島田"
    },
    {
        "code": "0149",
        "name": "光"
    },
    {
        "code": "0150",
        "name": "下松"
    },
    {
        "code": "0151",
        "name": "櫛ヶ浜"
    },
    {
        "code": "0152",
        "name": "徳山"
    },
    {
        "code": "0153",
        "name": "新南陽"
    },
    {
        "code": "0154",
        "name": "福川"
    },
    {
        "code": "0155",
        "name": "戸田"
    },
    {
        "code": "0156",
        "name": "富海"
    },
    {
        "code": "0157",
        "name": "防府"
    },
    {
        "code": "0158",
        "name": "大道"
    },
    {
        "code": "0159",
        "name": "四辻"
    },
    {
        "code": "0160",
        "name": "新山口"
    },
    {
        "code": "0161",
        "name": "嘉川"
    },
    {
        "code": "0162",
        "name": "本由良"
    },
    {
        "code": "0163",
        "name": "厚東"
    },
    {
        "code": "0164",
        "name": "宇部"
    },
    {
        "code": "0165",
        "name": "小野田"
    },
    {
        "code": "0166",
        "name": "厚狭"
    },
    {
        "code": "0167",
        "name": "埴生"
    },
    {
        "code": "0168",
        "name": "小月"
    },
    {
        "code": "0169",
        "name": "長府"
    },
    {
        "code": "0170",
        "name": "新下関"
    },
    {
        "code": "0171",
        "name": "幡生"
    },
    {
        "code": "0172",
        "name": "下関"
    },
    {
        "code": "0173",
        "name": "須波"
    },
    {
        "code": "0174",
        "name": "安芸幸崎"
    },
    {
        "code": "0175",
        "name": "忠海"
    },
    {
        "code": "0176",
        "name": "安芸長浜"
    },
    {
        "code": "0177",
        "name": "大乗"
    },
    {
        "code": "0178",
        "name": "竹原"
    },
    {
        "code": "0179",
        "name": "吉名"
    },
    {
        "code": "0180",
        "name": "安芸津"
    },
    {
        "code": "0181",
        "name": "風早"
    },
    {
        "code": "0182",
        "name": "安浦"
    },
    {
        "code": "0183",
        "name": "安登"
    },
    {
        "code": "0184",
        "name": "安芸川尻"
    },
    {
        "code": "0185",
        "name": "仁方"
    },
    {
        "code": "0186",
        "name": "広"
    },
    {
        "code": "0187",
        "name": "新広"
    },
    {
        "code": "0188",
        "name": "安芸阿賀"
    },
    {
        "code": "0189",
        "name": "呉"
    },
    {
        "code": "0190",
        "name": "川原石"
    },
    {
        "code": "0191",
        "name": "吉浦"
    },
    {
        "code": "0192",
        "name": "かるが浜"
    },
    {
        "code": "0193",
        "name": "天応"
    },
    {
        "code": "0194",
        "name": "呉ポートピア"
    },
    {
        "code": "0195",
        "name": "小屋浦"
    },
    {
        "code": "0196",
        "name": "水尻"
    },
    {
        "code": "0197",
        "name": "坂"
    },
    {
        "code": "0198",
        "name": "矢野"
    },
    {
        "code": "0199",
        "name": "三滝"
    },
    {
        "code": "0200",
        "name": "安芸長束"
    },
    {
        "code": "0201",
        "name": "下祇園"
    },
    {
        "code": "0202",
        "name": "古市橋"
    },
    {
        "code": "0203",
        "name": "大町"
    },
    {
        "code": "0204",
        "name": "緑井"
    },
    {
        "code": "0205",
        "name": "七軒茶屋"
    },
    {
        "code": "0206",
        "name": "梅林"
    },
    {
        "code": "0207",
        "name": "上八木"
    },
    {
        "code": "0208",
        "name": "中島"
    },
    {
        "code": "0209",
        "name": "可部"
    },
    {
        "code": "0210",
        "name": "上狛"
    },
    {
        "code": "0211",
        "name": "棚倉"
    },
    {
        "code": "0212",
        "name": "玉水"
    },
    {
        "code": "0213",
        "name": "山城多賀"
    },
    {
        "code": "0214",
        "name": "山城青谷"
    },
    {
        "code": "0215",
        "name": "長池"
    },
    {
        "code": "0216",
        "name": "城陽"
    },
    {
        "code": "0217",
        "name": "新田"
    },
    {
        "code": "0218",
        "name": "JR小倉"
    },
    {
        "code": "0219",
        "name": "宇治"
    },
    {
        "code": "0220",
        "name": "黄檗"
    },
    {
        "code": "0221",
        "name": "木幡"
    },
    {
        "code": "0222",
        "name": "六地蔵"
    },
    {
        "code": "0223",
        "name": "桃山"
    },
    {
        "code": "0224",
        "name": "JR藤森"
    },
    {
        "code": "0225",
        "name": "稲荷"
    },
    {
        "code": "0226",
        "name": "東福寺"
    },
    {
        "code": "0227",
        "name": "京都"
    },
    {
        "code": "0228",
        "name": "木津"
    },
    {
        "code": "0229",
        "name": "梅小路京都西"
    },
    {
        "code": "0230",
        "name": "丹波口"
    },
    {
        "code": "0231",
        "name": "二条"
    },
    {
        "code": "0232",
        "name": "円町"
    },
    {
        "code": "0233",
        "name": "花園"
    },
    {
        "code": "0234",
        "name": "太秦"
    },
    {
        "code": "0235",
        "name": "嵯峨嵐山"
    },
    {
        "code": "0236",
        "name": "保津峡"
    },
    {
        "code": "0237",
        "name": "馬堀"
    },
    {
        "code": "0238",
        "name": "亀岡"
    },
    {
        "code": "0239",
        "name": "並河"
    },
    {
        "code": "0240",
        "name": "千代川"
    },
    {
        "code": "0241",
        "name": "八木"
    },
    {
        "code": "0242",
        "name": "吉富"
    },
    {
        "code": "0243",
        "name": "園部"
    },
    {
        "code": "0244",
        "name": "船岡"
    },
    {
        "code": "0245",
        "name": "岡山"
    },
    {
        "code": "0246",
        "name": "大元"
    },
    {
        "code": "0247",
        "name": "備前西市"
    },
    {
        "code": "0248",
        "name": "妹尾"
    },
    {
        "code": "0249",
        "name": "備中箕島"
    },
    {
        "code": "0250",
        "name": "早島"
    },
    {
        "code": "0251",
        "name": "久々原"
    },
    {
        "code": "0252",
        "name": "茶屋町"
    },
    {
        "code": "0253",
        "name": "植松"
    },
    {
        "code": "0254",
        "name": "木見"
    },
    {
        "code": "0255",
        "name": "上の町"
    },
    {
        "code": "0256",
        "name": "児島"
    },
    {
        "code": "0257",
        "name": "宇多津"
    },
    {
        "code": "0258",
        "name": "彦崎"
    },
    {
        "code": "0259",
        "name": "備前片岡"
    },
    {
        "code": "0260",
        "name": "迫川"
    },
    {
        "code": "0261",
        "name": "常山"
    },
    {
        "code": "0262",
        "name": "八浜"
    },
    {
        "code": "0263",
        "name": "備前田井"
    },
    {
        "code": "0264",
        "name": "宇野"
    },
    {
        "code": "0265",
        "name": "上郡"
    },
    {
        "code": "0266",
        "name": "三石"
    },
    {
        "code": "0267",
        "name": "吉永"
    },
    {
        "code": "0268",
        "name": "和気"
    },
    {
        "code": "0269",
        "name": "熊山"
    },
    {
        "code": "0270",
        "name": "万富"
    },
    {
        "code": "0271",
        "name": "瀬戸"
    },
    {
        "code": "0272",
        "name": "上道"
    },
    {
        "code": "0273",
        "name": "東岡山"
    },
    {
        "code": "0274",
        "name": "高島"
    },
    {
        "code": "0275",
        "name": "西川原"
    },
    {
        "code": "0277",
        "name": "北長瀬"
    },
    {
        "code": "0278",
        "name": "庭瀬"
    },
    {
        "code": "0279",
        "name": "中庄"
    },
    {
        "code": "0280",
        "name": "西阿知"
    },
    {
        "code": "0281",
        "name": "新倉敷"
    },
    {
        "code": "0282",
        "name": "金光"
    },
    {
        "code": "0283",
        "name": "鴨方"
    },
    {
        "code": "0284",
        "name": "里庄"
    },
    {
        "code": "0285",
        "name": "笠岡"
    },
    {
        "code": "0286",
        "name": "大門"
    },
    {
        "code": "0287",
        "name": "東福山"
    },
    {
        "code": "0288",
        "name": "福山"
    },
    {
        "code": "0289",
        "name": "備後赤坂"
    },
    {
        "code": "0290",
        "name": "松永"
    },
    {
        "code": "0291",
        "name": "東尾道"
    },
    {
        "code": "0292",
        "name": "尾道"
    },
    {
        "code": "0312",
        "name": "河戸帆待川"
    },
    {
        "code": "0313",
        "name": "あき亀山"
    },
    {
        "code": "0375",
        "name": "日吉"
    },
    {
        "code": "0376",
        "name": "鍼灸大学前"
    },
    {
        "code": "0377",
        "name": "胡麻"
    },
    {
        "code": "0378",
        "name": "下山"
    },
    {
        "code": "0379",
        "name": "和知"
    },
    {
        "code": "0380",
        "name": "安栖里"
    },
    {
        "code": "0381",
        "name": "立木"
    },
    {
        "code": "0382",
        "name": "山家"
    },
    {
        "code": "0383",
        "name": "綾部"
    },
    {
        "code": "0384",
        "name": "高津"
    },
    {
        "code": "0385",
        "name": "石原"
    },
    {
        "code": "0386",
        "name": "福知山"
    },
    {
        "code": "0387",
        "name": "上川口"
    },
    {
        "code": "0388",
        "name": "下夜久野"
    },
    {
        "code": "0389",
        "name": "上夜久野"
    },
    {
        "code": "0390",
        "name": "梁瀬"
    },
    {
        "code": "0391",
        "name": "和田山"
    },
    {
        "code": "0392",
        "name": "養父"
    },
    {
        "code": "0393",
        "name": "八鹿"
    },
    {
        "code": "0395",
        "name": "江原"
    },
    {
        "code": "0396",
        "name": "国府"
    },
    {
        "code": "0397",
        "name": "豊岡"
    },
    {
        "code": "0398",
        "name": "玄武洞"
    },
    {
        "code": "0399",
        "name": "城崎温泉"
    },
    {
        "code": "0400",
        "name": "竹野"
    },
    {
        "code": "0401",
        "name": "佐津"
    },
    {
        "code": "0402",
        "name": "柴山"
    },
    {
        "code": "0403",
        "name": "香住"
    },
    {
        "code": "0404",
        "name": "鎧"
    },
    {
        "code": "0405",
        "name": "餘部"
    },
    {
        "code": "0406",
        "name": "久谷"
    },
    {
        "code": "0407",
        "name": "浜坂"
    },
    {
        "code": "0408",
        "name": "諸寄"
    },
    {
        "code": "0409",
        "name": "新三田"
    },
    {
        "code": "0410",
        "name": "広野"
    },
    {
        "code": "0411",
        "name": "相野"
    },
    {
        "code": "0412",
        "name": "藍本"
    },
    {
        "code": "0413",
        "name": "草野"
    },
    {
        "code": "0414",
        "name": "古市"
    },
    {
        "code": "0415",
        "name": "南矢代"
    },
    {
        "code": "0416",
        "name": "篠山口"
    },
    {
        "code": "0417",
        "name": "丹波大山"
    },
    {
        "code": "0418",
        "name": "下滝"
    },
    {
        "code": "0419",
        "name": "谷川"
    },
    {
        "code": "0420",
        "name": "柏原"
    },
    {
        "code": "0421",
        "name": "石生"
    },
    {
        "code": "0422",
        "name": "黒井"
    },
    {
        "code": "0423",
        "name": "市島"
    },
    {
        "code": "0424",
        "name": "丹波竹田"
    },
    {
        "code": "0425",
        "name": "姫路"
    },
    {
        "code": "0426",
        "name": "京口"
    },
    {
        "code": "0427",
        "name": "野里"
    },
    {
        "code": "0428",
        "name": "砥堀"
    },
    {
        "code": "0429",
        "name": "仁豊野"
    },
    {
        "code": "0430",
        "name": "香呂"
    },
    {
        "code": "0431",
        "name": "溝口"
    },
    {
        "code": "0432",
        "name": "福崎"
    },
    {
        "code": "0433",
        "name": "甘地"
    },
    {
        "code": "0434",
        "name": "鶴居"
    },
    {
        "code": "0435",
        "name": "新野"
    },
    {
        "code": "0436",
        "name": "寺前"
    },
    {
        "code": "0437",
        "name": "長谷"
    },
    {
        "code": "0438",
        "name": "生野"
    },
    {
        "code": "0439",
        "name": "新井"
    },
    {
        "code": "0440",
        "name": "青倉"
    },
    {
        "code": "0441",
        "name": "竹田"
    },
    {
        "code": "0442",
        "name": "淵垣"
    },
    {
        "code": "0443",
        "name": "梅迫"
    },
    {
        "code": "0444",
        "name": "真倉"
    },
    {
        "code": "0445",
        "name": "西舞鶴"
    },
    {
        "code": "0446",
        "name": "東舞鶴"
    },
    {
        "code": "0447",
        "name": "寺家"
    },
    {
        "code": "0448",
        "name": "近江塩津"
    },
    {
        "code": "0449",
        "name": "新疋田"
    },
    {
        "code": "0450",
        "name": "敦賀"
    },
    {
        "code": "0451",
        "name": "南今庄"
    },
    {
        "code": "0452",
        "name": "今庄"
    },
    {
        "code": "0453",
        "name": "湯尾"
    },
    {
        "code": "0454",
        "name": "南条"
    },
    {
        "code": "0455",
        "name": "王子保"
    },
    {
        "code": "0456",
        "name": "武生"
    },
    {
        "code": "0457",
        "name": "鯖江"
    },
    {
        "code": "0458",
        "name": "北鯖江"
    },
    {
        "code": "0459",
        "name": "大土呂"
    },
    {
        "code": "0460",
        "name": "越前花堂"
    },
    {
        "code": "0462",
        "name": "福井"
    },
    {
        "code": "0463",
        "name": "森田"
    },
    {
        "code": "0464",
        "name": "春江"
    },
    {
        "code": "0465",
        "name": "丸岡"
    },
    {
        "code": "0466",
        "name": "芦原温泉"
    },
    {
        "code": "0467",
        "name": "細呂木"
    },
    {
        "code": "0468",
        "name": "牛ノ谷"
    },
    {
        "code": "0469",
        "name": "大聖寺"
    },
    {
        "code": "0470",
        "name": "加賀温泉"
    },
    {
        "code": "0471",
        "name": "動橋"
    },
    {
        "code": "0472",
        "name": "粟津"
    },
    {
        "code": "0473",
        "name": "小松"
    },
    {
        "code": "0474",
        "name": "明峰"
    },
    {
        "code": "0475",
        "name": "能美根上"
    },
    {
        "code": "0476",
        "name": "小舞子"
    },
    {
        "code": "0477",
        "name": "美川"
    },
    {
        "code": "0478",
        "name": "加賀笠間"
    },
    {
        "code": "0479",
        "name": "松任"
    },
    {
        "code": "0480",
        "name": "野々市"
    },
    {
        "code": "0481",
        "name": "西金沢"
    },
    {
        "code": "0482",
        "name": "金沢"
    },
    {
        "code": "0488",
        "name": "新宮"
    },
    {
        "code": "0489",
        "name": "三輪崎"
    },
    {
        "code": "0490",
        "name": "紀伊佐野"
    },
    {
        "code": "0491",
        "name": "宇久井"
    },
    {
        "code": "0492",
        "name": "那智"
    },
    {
        "code": "0493",
        "name": "紀伊天満"
    },
    {
        "code": "0494",
        "name": "紀伊勝浦"
    },
    {
        "code": "0495",
        "name": "湯川"
    },
    {
        "code": "0496",
        "name": "太地"
    },
    {
        "code": "0497",
        "name": "下里"
    },
    {
        "code": "0498",
        "name": "紀伊浦神"
    },
    {
        "code": "0499",
        "name": "紀伊田原"
    },
    {
        "code": "0500",
        "name": "古座"
    },
    {
        "code": "0501",
        "name": "紀伊姫"
    },
    {
        "code": "0502",
        "name": "串本"
    },
    {
        "code": "0503",
        "name": "紀伊有田"
    },
    {
        "code": "0504",
        "name": "田並"
    },
    {
        "code": "0505",
        "name": "田子"
    },
    {
        "code": "0506",
        "name": "和深"
    },
    {
        "code": "0507",
        "name": "江住"
    },
    {
        "code": "0508",
        "name": "見老津"
    },
    {
        "code": "0510",
        "name": "周参見"
    },
    {
        "code": "0511",
        "name": "紀伊日置"
    },
    {
        "code": "0512",
        "name": "椿"
    },
    {
        "code": "0513",
        "name": "紀伊富田"
    },
    {
        "code": "0514",
        "name": "白浜"
    },
    {
        "code": "0515",
        "name": "朝来"
    },
    {
        "code": "0516",
        "name": "紀伊新庄"
    },
    {
        "code": "0517",
        "name": "紀伊田辺"
    },
    {
        "code": "0518",
        "name": "芳養"
    },
    {
        "code": "0519",
        "name": "南部"
    },
    {
        "code": "0520",
        "name": "岩代"
    },
    {
        "code": "0521",
        "name": "切目"
    },
    {
        "code": "0522",
        "name": "印南"
    },
    {
        "code": "0523",
        "name": "稲原"
    },
    {
        "code": "0524",
        "name": "和佐"
    },
    {
        "code": "0525",
        "name": "道成寺"
    },
    {
        "code": "0526",
        "name": "御坊"
    },
    {
        "code": "0527",
        "name": "紀伊内原"
    },
    {
        "code": "0528",
        "name": "紀伊由良"
    },
    {
        "code": "0529",
        "name": "広川ビーチ"
    },
    {
        "code": "0530",
        "name": "湯浅"
    },
    {
        "code": "0531",
        "name": "藤並"
    },
    {
        "code": "0532",
        "name": "紀伊宮原"
    },
    {
        "code": "0533",
        "name": "箕島"
    },
    {
        "code": "0534",
        "name": "初島"
    },
    {
        "code": "0535",
        "name": "下津"
    },
    {
        "code": "0536",
        "name": "加茂郷"
    },
    {
        "code": "0537",
        "name": "冷水浦"
    },
    {
        "code": "0538",
        "name": "海南"
    },
    {
        "code": "0539",
        "name": "黒江"
    },
    {
        "code": "0540",
        "name": "紀三井寺"
    },
    {
        "code": "0541",
        "name": "宮前"
    },
    {
        "code": "0542",
        "name": "和歌山"
    },
    {
        "code": "0543",
        "name": "五条"
    },
    {
        "code": "0544",
        "name": "大和二見"
    },
    {
        "code": "0545",
        "name": "隅田"
    },
    {
        "code": "0546",
        "name": "下兵庫"
    },
    {
        "code": "0547",
        "name": "橋本"
    },
    {
        "code": "0548",
        "name": "紀伊山田"
    },
    {
        "code": "0549",
        "name": "高野口"
    },
    {
        "code": "0550",
        "name": "中飯降"
    },
    {
        "code": "0551",
        "name": "妙寺"
    },
    {
        "code": "0552",
        "name": "大谷"
    },
    {
        "code": "0553",
        "name": "笠田"
    },
    {
        "code": "0554",
        "name": "西笠田"
    },
    {
        "code": "0555",
        "name": "名手"
    },
    {
        "code": "0556",
        "name": "粉河"
    },
    {
        "code": "0557",
        "name": "紀伊長田"
    },
    {
        "code": "0558",
        "name": "打田"
    },
    {
        "code": "0559",
        "name": "下井阪"
    },
    {
        "code": "0560",
        "name": "岩出"
    },
    {
        "code": "0561",
        "name": "船戸"
    },
    {
        "code": "0562",
        "name": "紀伊小倉"
    },
    {
        "code": "0563",
        "name": "布施屋"
    },
    {
        "code": "0564",
        "name": "千旦"
    },
    {
        "code": "0565",
        "name": "田井ノ瀬"
    },
    {
        "code": "####",
        "name": ""
    }
];

/**
 * 
 * @param {*} pos 
 */
function posMatch_other(pos) {
    return stations.filter(station => {
        if (station.code === pos) return station;
        
    });
}
