var stations = [
    {
        "code": "0382",
        "name": "米原"
    },
    {
        "code": "0384",
        "name": "彦根"
    },
    {
        "code": "0385",
        "name": "南彦根"
    },
    {
        "code": "0386",
        "name": "河瀬"
    },
    {
        "code": "0387",
        "name": "稲枝"
    },
    {
        "code": "0388",
        "name": "能登川"
    },
    {
        "code": "0389",
        "name": "安土"
    },
    {
        "code": "0390",
        "name": "近江八幡"
    },
    {
        "code": "0391",
        "name": "篠原"
    },
    {
        "code": "0392",
        "name": "野洲"
    },
    {
        "code": "0393",
        "name": "守山"
    },
    {
        "code": "0394",
        "name": "栗東"
    },
    {
        "code": "0395",
        "name": "草津"
    },
    {
        "code": "0396",
        "name": "南草津"
    },
    {
        "code": "0397",
        "name": "瀬田"
    },
    {
        "code": "0398",
        "name": "石山"
    },
    {
        "code": "0399",
        "name": "膳所"
    },
    {
        "code": "0400",
        "name": "大津"
    },
    {
        "code": "0401",
        "name": "山科"
    },
    {
        "code": "0402",
        "name": "京都"
    },
    {
        "code": "0404",
        "name": "西大路"
    },
    {
        "code": "0405",
        "name": "向日町"
    },
    {
        "code": "0406",
        "name": "長岡京"
    },
    {
        "code": "0407",
        "name": "山崎"
    },
    {
        "code": "0408",
        "name": "高槻"
    },
    {
        "code": "0409",
        "name": "摂津富田"
    },
    {
        "code": "0410",
        "name": "茨木"
    },
    {
        "code": "0411",
        "name": "千里丘"
    },
    {
        "code": "0412",
        "name": "岸辺"
    },
    {
        "code": "0413",
        "name": "吹田"
    },
    {
        "code": "0414",
        "name": "東淀川"
    },
    {
        "code": "0415",
        "name": "新大阪"
    },
    {
        "code": "0416",
        "name": "大阪"
    },
    {
        "code": "0417",
        "name": "塚本"
    },
    {
        "code": "0419",
        "name": "尼崎"
    },
    {
        "code": "0420",
        "name": "立花"
    },
    {
        "code": "0421",
        "name": "甲子園口"
    },
    {
        "code": "0422",
        "name": "西宮"
    },
    {
        "code": "0423",
        "name": "芦屋"
    },
    {
        "code": "0424",
        "name": "甲南山手"
    },
    {
        "code": "0425",
        "name": "摂津本山"
    },
    {
        "code": "0426",
        "name": "住吉"
    },
    {
        "code": "0427",
        "name": "六甲道"
    },
    {
        "code": "0428",
        "name": "摩耶"
    },
    {
        "code": "0429",
        "name": "灘"
    },
    {
        "code": "0430",
        "name": "三ノ宮"
    },
    {
        "code": "0431",
        "name": "元町"
    },
    {
        "code": "0432",
        "name": "神戸"
    },
    {
        "code": "0433",
        "name": "兵庫"
    },
    {
        "code": "0434",
        "name": "新長田"
    },
    {
        "code": "0435",
        "name": "鷹取"
    },
    {
        "code": "0436",
        "name": "須磨"
    },
    {
        "code": "0437",
        "name": "塩屋"
    },
    {
        "code": "0438",
        "name": "垂水"
    },
    {
        "code": "0439",
        "name": "舞子"
    },
    {
        "code": "0440",
        "name": "朝霧"
    },
    {
        "code": "0441",
        "name": "明石"
    },
    {
        "code": "0442",
        "name": "西明石"
    },
    {
        "code": "0443",
        "name": "大久保"
    },
    {
        "code": "0444",
        "name": "魚住"
    },
    {
        "code": "0445",
        "name": "土山"
    },
    {
        "code": "0446",
        "name": "東加古川"
    },
    {
        "code": "0447",
        "name": "加古川"
    },
    {
        "code": "0448",
        "name": "宝殿"
    },
    {
        "code": "0449",
        "name": "曽根"
    },
    {
        "code": "0450",
        "name": "ひめじ別所"
    },
    {
        "code": "0451",
        "name": "御着"
    },
    {
        "code": "0452",
        "name": "姫路"
    },
    {
        "code": "0453",
        "name": "英賀保"
    },
    {
        "code": "0454",
        "name": "網干"
    },
    {
        "code": "0455",
        "name": "竜野"
    },
    {
        "code": "0456",
        "name": "相生"
    },
    {
        "code": "0457",
        "name": "有年"
    },
    {
        "code": "0458",
        "name": "上郡"
    },
    {
        "code": "0459",
        "name": "三石"
    },
    {
        "code": "0460",
        "name": "さくら夙川"
    },
    {
        "code": "0461",
        "name": "島本"
    },
    {
        "code": "0462",
        "name": "須磨海浜公園"
    },
    {
        "code": "0463",
        "name": "はりま勝原"
    },
    {
        "code": "0464",
        "name": "桂川"
    },
    {
        "code": "0465",
        "name": "東姫路"
    },
    {
        "code": "0466",
        "name": "ＪＲ総持寺"
    },
    {
        "code": "0501",
        "name": "坂田"
    },
    {
        "code": "0502",
        "name": "田村"
    },
    {
        "code": "0503",
        "name": "長浜"
    },
    {
        "code": "0504",
        "name": "虎姫"
    },
    {
        "code": "0505",
        "name": "河毛"
    },
    {
        "code": "0506",
        "name": "高月"
    },
    {
        "code": "0507",
        "name": "木ノ本"
    },
    {
        "code": "0508",
        "name": "余呉"
    },
    {
        "code": "0509",
        "name": "近江塩津"
    },
    {
        "code": "0510",
        "name": "新疋田"
    },
    {
        "code": "0601",
        "name": "大津京"
    },
    {
        "code": "0602",
        "name": "唐崎"
    },
    {
        "code": "0603",
        "name": "比叡山坂本"
    },
    {
        "code": "0604",
        "name": "おごと温泉"
    },
    {
        "code": "0605",
        "name": "堅田"
    },
    {
        "code": "0606",
        "name": "小野"
    },
    {
        "code": "0607",
        "name": "和邇"
    },
    {
        "code": "0608",
        "name": "蓬莱"
    },
    {
        "code": "0609",
        "name": "志賀"
    },
    {
        "code": "0610",
        "name": "比良"
    },
    {
        "code": "0611",
        "name": "近江舞子"
    },
    {
        "code": "0612",
        "name": "北小松"
    },
    {
        "code": "0613",
        "name": "近江高島"
    },
    {
        "code": "0614",
        "name": "安曇川"
    },
    {
        "code": "0615",
        "name": "新旭"
    },
    {
        "code": "0616",
        "name": "近江今津"
    },
    {
        "code": "0617",
        "name": "近江中庄"
    },
    {
        "code": "0618",
        "name": "マキノ"
    },
    {
        "code": "0919",
        "name": "永原"
    },
    {
        "code": "1204",
        "name": "南吹田"
    },
    {
        "code": "1206",
        "name": "ＪＲ淡路"
    },
    {
        "code": "1207",
        "name": "城北公園通"
    },
    {
        "code": "1208",
        "name": "ＪＲ野江"
    },
    {
        "code": "1301",
        "name": "鴫野"
    },
    {
        "code": "1302",
        "name": "放出"
    },
    {
        "code": "1303",
        "name": "徳庵"
    },
    {
        "code": "1304",
        "name": "鴻池新田"
    },
    {
        "code": "1305",
        "name": "住道"
    },
    {
        "code": "1306",
        "name": "野崎"
    },
    {
        "code": "1307",
        "name": "四条畷"
    },
    {
        "code": "1308",
        "name": "忍ケ丘"
    },
    {
        "code": "1309",
        "name": "寝屋川公園"
    },
    {
        "code": "1310",
        "name": "星田"
    },
    {
        "code": "1311",
        "name": "河内磐船"
    },
    {
        "code": "1312",
        "name": "津田"
    },
    {
        "code": "1313",
        "name": "藤阪"
    },
    {
        "code": "1314",
        "name": "長尾"
    },
    {
        "code": "1315",
        "name": "松井山手"
    },
    {
        "code": "1316",
        "name": "大住"
    },
    {
        "code": "1317",
        "name": "京田辺"
    },
    {
        "code": "1318",
        "name": "同志社前"
    },
    {
        "code": "1319",
        "name": "ＪＲ三山木"
    },
    {
        "code": "1320",
        "name": "下狛"
    },
    {
        "code": "1321",
        "name": "祝園"
    },
    {
        "code": "1322",
        "name": "西木津"
    },
    {
        "code": "1501",
        "name": "大阪城北詰"
    },
    {
        "code": "1502",
        "name": "大阪天満宮"
    },
    {
        "code": "1503",
        "name": "北新地"
    },
    {
        "code": "1504",
        "name": "新福島"
    },
    {
        "code": "1505",
        "name": "海老江"
    },
    {
        "code": "1506",
        "name": "御幣島"
    },
    {
        "code": "1508",
        "name": "加島"
    },
    {
        "code": "1601",
        "name": "塚口"
    },
    {
        "code": "1602",
        "name": "猪名寺"
    },
    {
        "code": "1603",
        "name": "伊丹"
    },
    {
        "code": "1604",
        "name": "北伊丹"
    },
    {
        "code": "1605",
        "name": "川西池田"
    },
    {
        "code": "1606",
        "name": "中山寺"
    },
    {
        "code": "1607",
        "name": "宝塚"
    },
    {
        "code": "1608",
        "name": "生瀬"
    },
    {
        "code": "1609",
        "name": "西宮名塩"
    },
    {
        "code": "1610",
        "name": "武田尾"
    },
    {
        "code": "1611",
        "name": "道場"
    },
    {
        "code": "1612",
        "name": "三田"
    },
    {
        "code": "1613",
        "name": "新三田"
    },
    {
        "code": "1614",
        "name": "広野"
    },
    {
        "code": "2301",
        "name": "西相生"
    },
    {
        "code": "2302",
        "name": "坂越"
    },
    {
        "code": "2303",
        "name": "播州赤穂"
    },
    {
        "code": "2305",
        "name": "天和"
    },
    {
        "code": "2501",
        "name": "福島"
    },
    {
        "code": "2502",
        "name": "野田"
    },
    {
        "code": "2503",
        "name": "西九条"
    },
    {
        "code": "2504",
        "name": "弁天町"
    },
    {
        "code": "2506",
        "name": "大正"
    },
    {
        "code": "2507",
        "name": "芦原橋"
    },
    {
        "code": "2508",
        "name": "今宮"
    },
    {
        "code": "2509",
        "name": "新今宮"
    },
    {
        "code": "2510",
        "name": "天王寺"
    },
    {
        "code": "2511",
        "name": "寺田町"
    },
    {
        "code": "2512",
        "name": "桃谷"
    },
    {
        "code": "2513",
        "name": "鶴橋"
    },
    {
        "code": "2514",
        "name": "玉造"
    },
    {
        "code": "2515",
        "name": "森ノ宮"
    },
    {
        "code": "2516",
        "name": "大阪城公園"
    },
    {
        "code": "2517",
        "name": "京橋"
    },
    {
        "code": "2518",
        "name": "桜ノ宮"
    },
    {
        "code": "2519",
        "name": "天満"
    },
    {
        "code": "2551",
        "name": "安治川口"
    },
    {
        "code": "2552",
        "name": "ユニバーサルシティ"
    },
    {
        "code": "2553",
        "name": "桜島"
    },
    {
        "code": "2601",
        "name": "美章園"
    },
    {
        "code": "2602",
        "name": "南田辺"
    },
    {
        "code": "2603",
        "name": "鶴ケ丘"
    },
    {
        "code": "2604",
        "name": "長居"
    },
    {
        "code": "2605",
        "name": "我孫子町"
    },
    {
        "code": "2606",
        "name": "杉本町"
    },
    {
        "code": "2607",
        "name": "浅香"
    },
    {
        "code": "2608",
        "name": "堺市"
    },
    {
        "code": "2609",
        "name": "三国ケ丘"
    },
    {
        "code": "2610",
        "name": "百舌鳥"
    },
    {
        "code": "2611",
        "name": "上野芝"
    },
    {
        "code": "2613",
        "name": "鳳"
    },
    {
        "code": "2614",
        "name": "富木"
    },
    {
        "code": "2615",
        "name": "北信太"
    },
    {
        "code": "2616",
        "name": "信太山"
    },
    {
        "code": "2617",
        "name": "和泉府中"
    },
    {
        "code": "2618",
        "name": "久米田"
    },
    {
        "code": "2619",
        "name": "下松"
    },
    {
        "code": "2620",
        "name": "東岸和田"
    },
    {
        "code": "2621",
        "name": "東貝塚"
    },
    {
        "code": "2622",
        "name": "和泉橋本"
    },
    {
        "code": "2623",
        "name": "東佐野"
    },
    {
        "code": "2624",
        "name": "熊取"
    },
    {
        "code": "2625",
        "name": "日根野"
    },
    {
        "code": "2651",
        "name": "東羽衣"
    },
    {
        "code": "2701",
        "name": "りんくうタウン"
    },
    {
        "code": "2702",
        "name": "関西空港"
    },
    {
        "code": "3002",
        "name": "ＪＲ難波"
    },
    {
        "code": "3003",
        "name": "東部市場前"
    },
    {
        "code": "3005",
        "name": "平野"
    },
    {
        "code": "3008",
        "name": "加美"
    },
    {
        "code": "3009",
        "name": "久宝寺"
    },
    {
        "code": "3010",
        "name": "八尾"
    },
    {
        "code": "3011",
        "name": "志紀"
    },
    {
        "code": "3012",
        "name": "柏原"
    },
    {
        "code": "3013",
        "name": "高井田"
    },
    {
        "code": "3014",
        "name": "河内堅上"
    },
    {
        "code": "3015",
        "name": "三郷"
    },
    {
        "code": "3016",
        "name": "王寺"
    },
    {
        "code": "3017",
        "name": "法隆寺"
    },
    {
        "code": "3018",
        "name": "大和小泉"
    },
    {
        "code": "3019",
        "name": "郡山"
    },
    {
        "code": "3020",
        "name": "奈良"
    },
    {
        "code": "3022",
        "name": "平城山"
    },
    {
        "code": "3023",
        "name": "木津"
    },
    {
        "code": "3024",
        "name": "加茂"
    },
    {
        "code": "3025",
        "name": "笠置"
    },
    {
        "code": "3701",
        "name": "長滝"
    },
    {
        "code": "3702",
        "name": "新家"
    },
    {
        "code": "3703",
        "name": "和泉砂川"
    },
    {
        "code": "3704",
        "name": "和泉鳥取"
    },
    {
        "code": "3705",
        "name": "山中渓"
    },
    {
        "code": "3706",
        "name": "紀伊"
    },
    {
        "code": "3707",
        "name": "六十谷"
    },
    {
        "code": "3708",
        "name": "紀伊中ノ島"
    },
    {
        "code": "3709",
        "name": "和歌山"
    },
    {
        "code": "6061",
        "name": "津久野"
    },
    {
        "code": "8001",
        "name": "新加美"
    },
    {
        "code": "8003",
        "name": "ＪＲ長瀬"
    },
    {
        "code": "8004",
        "name": "ＪＲ俊徳道"
    },
    {
        "code": "8005",
        "name": "ＪＲ河内永和"
    },
    {
        "code": "8006",
        "name": "高井田中央"
    },
    {
        "code": "8007",
        "name": "衣摺加美北"
    },
    {
        "code": "####",
        "name": ""
    }
];

// var pos = "####";
// console.log(
//     stations.filter(x => pos.includes(x.code))
// );
/**
 * 
 * @param {*} pos 
 */
function posMatch(pos) {
    return stations.filter(station => {
        if (station.code === pos) return station;
        
    });
}

// console.log(posMatch());
